let x = prompt("Шөлтэй устай хоол идэх үү? Тийм бол 1, Үгүй бол 2 гэж оруул");

if (x == 1) {
  x = prompt("Цайтай юу? Тийм бол 1, Үгүй бол 2 гэж оруул");
  if (x == 1) {
    x = prompt("Банштай юу? Тийм бол 1, Үгүй бол 2 гэж оруул");
    if (x == 1) {
      alert("Банштай цай");
    } else if (x == 2) {
      alert("Будаатай цай");
    }
  } else if (x == 2) {
    x = prompt(
      "Юутай шөл идэх вэ? Хүссэн сонголтын тоог оруулна уу 1. Гурилтай 2. Пүнтүүзтэй 3. Гоймонтой 4. Банштай 5. Махтай 6. Ногоотой"
    );
    if (x == 1) {
      alert("Лапша");
    } else if (x == 2) {
      alert("Хуйцай");
    } else if (x == 3) {
      alert("Гоймонтой шөл");
    } else if (x == 4) {
      alert("Банштай шөл");
    } else if (x == 5) {
      alert("Хар шөл");
    } else if (x == 6) {
      alert("Ногоотой шөл");
    }
  }
} else if (x == 2) {
  x = prompt("Мах нь татсан уу? Тийм бол 1, Үгүй бол 2 гэж оруул");
  if (x == 1) {
    x = prompt(
      "Гурилтай юу, будаатай юу? Хүссэн сонголтын тоог оруулна уу 1. Гурил 2. Будаа"
    );
    if (x == 1) {
      x = prompt(
        "Яаж болгосон бэ? Хүссэн сонголтын тоог оруулна уу 1. Шарсан 2. Жигнэсэн"
      );
      if (x == 1) {
        x = prompt("Хөөлгөгч хийх үү? Тийм бол 1, Үгүй бол 2 гэж оруул");
        if (x == 1) {
          alert("Пирошки");
        } else if (x == 2) {
          alert("Хуушуур");
        }
      } else if (x == 2) {
        x = prompt("Хөөлгөгч хийх үү? Тийм бол 1, Үгүй бол 2 гэж оруул");
        if (x == 1) {
          alert("Мантуун бууз");
        } else if (x == 2) {
          alert("Бууз");
        }
      }
    } else if (x == 2) {
      x = prompt("Өндөгтэй юу? Тийм бол 1, Үгүй бол 2 гэж оруул");
      if (x == 1) {
        alert("Өндөгтэй бифштекс");
      } else if (x == 2) {
        alert("Тефтель");
      }
    }
  } else if (x == 2) {
    x = prompt(
      "Юутай холих вэ? Хүссэн сонголтын тоог оруулна уу 1. Гурилтай 2. Өндөгтэй 3. Будаатай 4. Ногоотой"
    );
    if (x == 1) {
      alert("Цуйван");
    } else if (x == 2) {
      alert("Өндөгтэй хуурга");
    } else if (x == 3) {
      x = prompt("Хооронд нь холих уу? Тийм бол 1, Үгүй бол 2 гэж оруул");
      if (x == 1) {
        alert("Будаатай хуурга");
      } else if (x == 2) {
        alert("Гуляш");
      }
    } else if (x == 4) {
      alert("Ногоотой хуурга");
    }
  }
}